<a href="https://colab.research.google.com/github/ronidad/Moringa-week3/blob/main/Moringa_Data_Science_Prep_W3_Independent_Project_2021_08_Ronald_Mosomi_Python_Notebook.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **MTN Cote d'Ivoire Project on Network expansion**

Having received raw data for network expansion recomendation in various cities Ivory coast, We will try to get the best recomendations on the data available for Voice, Data and sms usage.

***1. We will import required libraries***

In [ ]:
#pandas 
import pandas as pd

***2. Load datasets provided from the URLs***

In [168]:
#Geo descriptions
CDR_DESC = pd.read_excel("CDR_description.xlsx")
CDR_DESC.head()

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String

In [169]:
#Data set 1
data1 = pd.read_csv("Telcom_dataset.csv")
data1.head(1)

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu

[1 rows x 10 columns]

In [170]:
#dataset 2
data2 = pd.read_csv("Telcom_dataset2.csv")
data2.head(1)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2

[1 rows x 10 columns]

In [171]:
#Load data 3
data3 = pd.read_csv("Telcom_dataset3.csv")
data3.head(1)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx

[1 rows x 10 columns]

In [172]:
#Load geo cells 
GeoData = pd.read_csv("cells_geo.csv", delimiter=";")
GeoData.head(1)

   Unnamed: 0  VILLES      STATUS  ... AREA     CELL_ID   SITE_CODE
0           0  ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17

[1 rows x 12 columns]

In [173]:
#load geo description
#This data tells us that Cell ID will help us merge the city of the two data sets
GeoDes = pd.read_excel("cells_geo_description.xlsx")
GeoDes.head(10)

    Column name        Description  Format
0        VILLES               City  String
1        STATUS  In Service or not  String
2  LOCALISATION  in ABIDJAN or not  String
3    DECOUPZONE  Geographical Zone  String
4      ZONENAME       Name of Zone  String
5     LONGITUDE          Longitude   Float
6      LATITUDE           Latitude   Float
7        REGION             Region  String
8          AREA               Area  String
9       CELL_ID     ID of the cell  String

***3. merge the 3 dataset to ahve one big for the 3 days***

In [ ]:
#Since some columns have slightly different headers, rename them

data1.rename(columns=
{
"PRODUTC": "PRODUCT",
"DW_A_NUMBER_INT": "DW_A_NUMBER",
 "DW_B_NUMBER_INT": "DW_B_NUMBER",
 "DATETIME": "DATE_TIME"
 
}, inplace=True)
print(data1.columns)

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'CELL_ON_SITE', 'DW_A_NUMBER',
       'DW_B_NUMBER', 'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')

In [ ]:
#Data 3 column names
data3.rename(columns=
{
"PRODUTC": "PRODUCT",
"DW_A_NUMBER_INT": "DW_A_NUMBER",
"DW_B_NUMBER_INT": "DW_B_NUMBER",
"CELLID": "CELL_ID",
"SIET_ID": "SITE_ID",

 
}, inplace=True)
print(data3.columns)

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'CELL_ON_SITE', 'DW_A_NUMBER',
       'DW_B_NUMBER', 'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')

In [ ]:
#Concatinate the 3 data sets 
datas = [data1, data2, data3]
Telcom_data = pd.concat(datas)

***4. Data cleaning***

In [174]:
Telcom_data.head()

  PRODUCT  VALUE              DATE_TIME  ...     SITE_ID                DATE Hour
0   Voice      0  2012-05-06 23:04:37.0  ...  /TJNe+Mmtu 2012-05-06 23:04:37   23
1     sms      0  2012-05-06 23:05:25.0  ...  /+cKZKIp41 2012-05-06 23:05:25   23
2     sms     25  2012-05-06 23:05:41.0  ...  /u0FSD+ahi 2012-05-06 23:05:41   23
3   Voice     56  2012-05-06 23:05:42.0  ...  +cNeJzsTp3 2012-05-06 23:05:42   23
4   Voice     14  2012-05-06 23:06:29.0  ...  051KhYDCpv 2012-05-06 23:06:29   23

[5 rows x 12 columns]

In [ ]:
#Drop the most obvious duplicates that appears all through the rows
Telcom_data.drop_duplicates(inplace=True)

Change date column to date time object

In [ ]:
Telcom_data["DATE"]= pd.to_datetime(Telcom_data["DATE_TIME"])

In [175]:
#Get the overview of the data by descriping and geting the info to know what extra to drop
Telcom_data.info()
Telcom_data.describe()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14750 entries, 0 to 5000
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PRODUCT       14750 non-null  object
 1   VALUE         14750 non-null  int64
 2   DATE_TIME     14750 non-null  object
 3   CELL_ON_SITE  14750 non-null  object
 4   DW_A_NUMBER   14750 non-null  object
 5   DW_B_NUMBER   14750 non-null  object
 6   COUNTRY_A     14750 non-null  object
 7   COUNTRY_B     14750 non-null  object
 8   CELL_ID       14750 non-null  object
 9   SITE_ID       12789 non-null  object
 10  DATE          14750 non-null  datetime64[ns]
 11  Hour          14750 non-null  int64
dtypes: datetime64[ns](1), int64(2), object(9)
memory usage: 1.8+ MB

              VALUE          Hour
count  14750.000000  14750.000000
mean      25.517153      3.148271
std      153.573705      7.905875
min        0.000000      0.000000
25%        0.000000      0.000000
50%        0.000000      0.000000
75%       25.000000      0.000000
max    12900.000000     23.000000

In [ ]:
#Data understanding
#since cell ID and call_Id appears in bothe Geo data and the really data, 
#they will help us get the city since it appears in the Geo 

#Lets the one with highest uniques values in The data we have combines
print("Cell ID unique values: " + str(len(Telcom_data['CELL_ID'].unique())))  
print("Site ID unique values: " + str(len(Telcom_data['SITE_ID'].unique())))

Cell ID unique values: 2677
Site ID unique values: 1358

In [ ]:
#We will use Cell ID to get the inner analysis of the data so that we make conclusion

In [ ]:
#Questions for decisions making

**Questions for decisions making**

***1. Which ones were the most used city for the three days?***

In [ ]:
#using the cell ID that appears in both data sets


Telcom_data.groupby("CELL_ID")['SITE_ID'].sum()

CELL_ID
++ctND+jGD    ++ctND+jGD++ctND+jGD++ctND+jGD++ctND+jGD++ctND...
+38u2u/rfx    +38u2u/rfx+38u2u/rfx+38u2u/rfx+38u2u/rfx+38u2u...
+854AcBQT2    +854AcBQT2+854AcBQT2+854AcBQT2+854AcBQT2+854Ac...
+Fs4mTvdKx    +Fs4mTvdKx+Fs4mTvdKx+Fs4mTvdKx+Fs4mTvdKx+Fs4mT...
+QZ9qRtNxA    +QZ9qRtNxA+QZ9qRtNxA+QZ9qRtNxA+QZ9qRtNxA+QZ9qR...
                                    ...
ff97ccaf78             b23d0cd21db23d0cd21db23d0cd21db23d0cd21d
ff99709d62                                 2d5ab30ced2d5ab30ced
ffa6759bb2                                                    0
ffb86d66d2    4df1cab7804df1cab7804df1cab7804df1cab7804df1ca...
ffcc507579             1ea909bdfc1ea909bdfc1ea909bdfc1ea909bdfc
Name: SITE_ID, Length: 2677, dtype: object

In [ ]:
Telcom_data['SITE_ID'].value_counts().head()

7f76d66503    110
b47a998a3e     98
a7bd4c027b     79
5c565fbfb1     75
91e86be9a6     72
Name: SITE_ID, dtype: int64

In [ ]:
#Check the city with SITE_CODE = 7f76d66503    from the Geo data set 
city_1 = GeoData[GeoData['SITE_CODE']=="7f76d66503"]['VILLES'].head(1)
city_2 = GeoData[GeoData['SITE_CODE']=="b47a998a3e"]['VILLES'].head(1)

In [ ]:
#The Cities that received many calls, sms and data usage were ATTECOUBE and YOPOUGON
print("MTN should prioritize the following cities  for network expansion as it has many user: ")
print(city_1)
print(city_2)

MTN should prioritize the following cities  for network expansion as it has many user:
1024    ATTECOUBE
Name: VILLES, dtype: object
2832    YOPOUGON
Name: VILLES, dtype: object

**2. Most popular product**

In [ ]:
# Most popular product
Telcom_data['PRODUCT'].value_counts().head()

# this shows that many people like sending text messages than calls and voice hence the company should invest more
# on the sms part.

sms      6950
Voice    5570
data     2230
Name: PRODUCT, dtype: int64

3. ***Calls during working hours and non working hours***

In [131]:
#Create hour to help in getting woorking hours
Telcom_data["Hour"] = Telcom_data["DATE"].dt.hour

In [176]:
Telcom_data.head()

  PRODUCT  VALUE              DATE_TIME  ...     SITE_ID                DATE Hour
0   Voice      0  2012-05-06 23:04:37.0  ...  /TJNe+Mmtu 2012-05-06 23:04:37   23
1     sms      0  2012-05-06 23:05:25.0  ...  /+cKZKIp41 2012-05-06 23:05:25   23
2     sms     25  2012-05-06 23:05:41.0  ...  /u0FSD+ahi 2012-05-06 23:05:41   23
3   Voice     56  2012-05-06 23:05:42.0  ...  +cNeJzsTp3 2012-05-06 23:05:42   23
4   Voice     14  2012-05-06 23:06:29.0  ...  051KhYDCpv 2012-05-06 23:06:29   23

[5 rows x 12 columns]

In [162]:
#Calls and sms done within working hours
#Results shows none

Telcom_data[(Telcom_data['Hour'] >= 8) & (Telcom_data['Hour'] <= 17)]["PRODUCT"].value_counts()

Series([], Name: PRODUCT, dtype: int64)

In [167]:
#Calls, sms and data during non working  hours
(Telcom_data[(Telcom_data['Hour'] >= 18) & (Telcom_data['Hour'] <= 23)]["PRODUCT"].value_counts())+(Telcom_data[(Telcom_data['Hour'] >= 0) & (Telcom_data['Hour'] <= 7)]["PRODUCT"].value_counts())

sms      6950
Voice    5570
data     2230
Name: PRODUCT, dtype: int64

It seems the data was collected when people had left work. Actually most of the data was collected at mifnight.